{
    "1_🔑_Autenticação": {
        "content": "### Sobre a Página: 1_🔑_Autenticação\nA página \"1_🔑_Autenticação\" da aplicação Streamlit serve como portal de entrada para os utilizadores do Gauge Metrics, permitindo-lhes acessar o sistema de forma segura. Suas funcionalidades principais incluem login, registro e recuperação de senha, além de apresentar uma integração com o sistema Jira para oferecer uma experiência centralizada de gestão e análise de projetos. \n\n### Como Usar\n1. **Acessar a página**: Ao entrar na página, os utilizadores devem interagir com o painel de login centralizado.\n2. **Efetuar Login**:\n   - Preencha seu e-mail e senha cadastrados e marque a opção \"Lembrar-me\" se desejar que seu e-mail seja lembrado em futuras visitas.\n   - Clique em \"Entrar\". O sistema validará suas credenciais e estabelecerá uma conexão com o Jira, se aplicável.\n3. **Registrar-se**:\n   - Alternativamente, clique na aba de \"Registrar-se\".\n   - Insira o seu e-mail corporativo, crie uma senha e confirme-a.\n   - Após submissão bem-sucedida, siga as instruções para completar a configuração da conta.\n4. **Recuperação de Senha**:\n   - Se necessário, use a aba de \"Recuperar Senha\" inserindo o seu e-mail. O sistema enviará uma senha temporária para continuar.\n\n5. **Navegação**:\n   - Se estiver logado, você poderá acessar outras páginas através da barra lateral. Caso contrário, o menu será ocultado para proteger o acesso.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: Como faço para redefinir minha senha se eu a esqueci?**  \n*R: Na aba \"Recuperar Senha\", insira seu e-mail registrado. Se for válido, você receberá um e-mail com uma senha temporária.*\n\n**P: O que significa a opção \"Lembrar-me\" no formulário de login?**  \n*R: A opção \"Lembrar-me\" armazena seu e-mail no estado da sessão para facilitar logins futuros, mas não armazena a senha por questões de segurança.*\n\n**P: Como eu faço para registrar uma nova conta?**  \n*R: Clique na aba \"Registrar-se\", preencha seu e-mail corporativo, crie e confirme uma senha, e então clique em \"Registrar\". Um e-mail de boas-vindas será enviado com instruções adicionais.*\n\n**P: O que acontece se eu tentar acessar uma funcionalidade sem estar logado?**  \n*R: O menu de navegação será oculto e um aviso será exibido, impedindo o acesso não autorizado a outras funcionalidades da aplicação.*\n\n**P: Como posso configurar minha conexão com o Jira após o primeiro login?**  \n*R: Uma vez logado, siga as instruções na aplicação para ativar uma conexão Jira válida. Qualquer erro ou status da conexão é reportado com mensagens específicas e uma página de gestão é indicada para a resolução.*",
        "last_updated": "2025-10-17T18:30:50.642144"
    },
    "10_👑_Administração": {
        "content": "### Sobre a Página: Administração\nA página \"Administração\" do aplicativo Streamlit é destinada ao gerenciamento e configuração de aspectos centrais da aplicação, acessível apenas para usuários administradores devidamente autenticados. Esta interface permite o gerenciamento de conteúdo do Product Hub, configuração de sistema, ajustes de KPIs, gestão de usuários e controle de envio de e-mails. Além disso, fornece ferramentas para manter conexões com serviços externos, como Jira, e para definir papéis e competências dos usuários.\n\n### Como Usar\n\n1. **Acesso à Página:**\n   - Faça login no aplicativo utilizando suas credenciais de administrador.\n   - Acesse a página de \"Administração\" só após garantir que uma conexão ativa com o Jira esteja estabelecida, caso contrário, você será redirecionado para ativá-la.\n\n2. **Gestão de Conteúdo:**\n   - Utilize as abas para gerenciar Playbooks, Competências e Papéis.\n   - Adicione novos temas de Playbook, edite conteúdos existentes ou remova pelo painel de controle com editores de texto ricos.\n   - Para as Competências, edite as Hard Skills e Soft Skills diretamente em tabelas editáveis.\n\n3. **Configurações do Sistema:**\n   - Configure domínios permitidos para registro na aba \"Domínios\".\n   - Gerencie usuários para redefinição de senhas ou exclusão de registros.\n   - Ajuste metas de KPI na aba \"Metas\".\n   - Configure um provedor de e-mail para envio global na aba \"E-mail\".\n\n4. **Gestão de Papéis:**\n   - Utilize as funcionalidades de adicionar, editar ou remover papéis, garantindo que as definições de funções e responsabilidades estejam atuais.\n\n5. **Configurações Gerais:**\n   - Revise e ajuste a URL base da aplicação e os domínios autorizados para cadastro.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: Como eu faço para adicionar um novo tema de Playbook?**\n*R: Acesse a aba \"📄 Gestão de Conteúdo\" e selecione a aba \"📖 Playbooks\". Expanda a seção \"➕ Adicionar Novo Tema de Playbook\", insira o nome do tema e seu conteúdo no editor de texto, e clique em \"Adicionar Tema\".*\n\n**P: O que significa a seção de \"Configurações do Sistema\"?**\n*R: Esta seção permite configurar aspectos globais da aplicação, como domínios permitidos para registro, redefinição de senhas de usuários, metas de KPIs, e configuração de envio de e-mails via provedores como SendGrid ou Gmail.*\n\n**P: Como eu posso gerenciar os papéis do Product Hub?**\n*R: Utilize a aba \"👨‍🔬 Papéis\" sob \"Gestão de Conteúdo\" para adicionar novos papéis, editar suas definições ou excluir papéis existentes. Detalhes podem ser ajustados com a ajuda de um editor de texto rico.*\n\n**P: O que devo fazer caso a minha sessão expire?**\n*R: Você será notificado sobre a expiração da sessão após um período de inatividade. Basta fazer login novamente acessando a página de \"Autenticação\" para retomar suas atividades.*\n\n**P: Como posso configurar o envio de e-mails através da aplicação?**\n*R: Na aba \"📧 E-mail\" das \"Configurações do Sistema\", selecione um provedor de e-mail e insira as credenciais necessárias. Após validação, as credenciais serão salvas para uso em toda a aplicação.*",
        "last_updated": "2025-10-16T11:35:05.892348"
    },
    "14_💰_Valoração_Comercial": {
        "content": "### Sobre a Página: Valoração_Comercial\nA página \"Valoração_Comercial\" faz parte de uma aplicação Streamlit destinada a facilitar a gestão de projetos e serviços através de uma integração com o Jira. Ela se concentra na valoração de serviços e na geração de Ordens de Serviço (OS). A página permite aos usuários configurar catálogos de serviços, ajustar valores e moedas, e criar layouts personalizados para OS. Dentre suas funcionalidades-chave estão a importação de catálogos de serviços de fontes externas (como arquivos CSV e links de SharePoint ou Google Planilhas), o uso de inteligência artificial para preencher automaticamente dados a partir de textos ou issues do Jira, e a geração de um PDF finalizado que pode ser descarregado.\n\n### Como Usar\n1. **Login e Sessão:**\n   - Certifique-se de estar logado; caso contrário, acesse a página de Autenticação.\n   - Verifique se sua sessão não expirou por inatividade.\n\n2. **Seleção de Projeto:**\n   - Utilize a barra lateral para selecionar o projeto desejado para gerenciar o catálogo.\n\n3. **Configurações da Página:**\n   - Na aba \"⚙️ Configurações\", você pode configurar a moeda e importar um catálogo de serviços.\n   - Importe catálogos via carregamento direto de um arquivo CSV, ou insira links de SharePoint ou Google Planilhas.\n   - Faça o mapeamento apropriado das colunas do seu catálogo ao sistema.\n\n4. **Construção de Layouts de OS:**\n   - Crie novos layouts de OS conforme necessário, definindo campos específicos a serem incluídos em cada ordem.\n   - Customize campos usando diferentes tipos, como texto, seleções, datas, e imagens.\n\n5. **Geração de Ordem de Serviço:**\n   - Na aba \"📄 Gerar OS\", selecione um layout previamente definido para gerar uma ordem.\n   - Utilize a IA para preencher automaticamente dados utilizando texto descritivo ou uma chave de issue do Jira.\n   - Preencha ou edite manualmente dados adicionais e itens do catálogo antes de gerar o PDF da OS.\n\n6. **Salvar e Baixar PDFs:**\n   - Salve modelos de OS para reutilização futura.\n   - Gere um PDF completo da OS e faça download diretamente através do botão fornecido.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: Como faço para importar um catálogo de serviços?**\n*R: Você pode importar um catálogo através de três métodos: carregando um arquivo CSV diretamente, fornecendo um link de um arquivo no SharePoint, ou um link de uma Google Planilha. Certifique-se de mapear as colunas do arquivo para os campos esperados pelo sistema.*\n\n**P: O que significa \"Pré-visualizar OS\"?**\n*R: A pré-visualização permite que você veja como a Ordem de Serviço será formatada e exibida, incluindo todos os dados e valores antes de gerar o PDF final. Isso ajuda a garantir que todas as informações estejam corretas.*\n\n**P: Como eu faço para usar a inteligência artificial para preencher dados da OS?**\n*R: Você tem duas opções: pode preencher os dados inserindo uma chave de issue do Jira para buscar informações automaticamente, ou fornecer uma descrição de texto do que precisa ser feito para a IA interpretar e pré-preencher os campos.*\n\n**P: O que acontece se eu não selecionar um layout de OS?**\n*R: Se nenhum layout for selecionado, você verá um aviso para criar ou selecionar um layout na aba de 'Configurações' primeiro, pois os layouts são necessários para gerar uma ordem de serviço.*\n\n**P: Posso excluir layouts ou modelos de OS criados?**\n*R: Sim, você pode excluir layouts na seção de edição ou modelos diretamente na aba de geração de OS. Utilize os botões de exclusão apropriados ao lado dos nomes dos layouts ou modelos.*",
        "last_updated": "2025-10-16T11:33:02.825417"
    },
    "11_🔮_Insights_AI": {
        "content": "### Sobre a Página: Insights_AI\nA página \"Insights_AI\" faz parte de uma aplicação desenvolvida em Streamlit chamada \"Gauge AI\". O principal propósito desta página é permitir que os usuários obtenham insights estratégicos a partir de dados de projetos geridos no Jira. Utilizando inteligência artificial, a página fornece um diagnóstico estratégico detalhado e permite que o usuário interaja com a plataforma através de um sistema de chat integrado. Além disso, oferece métricas executivas e auxilia no planejamento de ações com base nos dados contextualizados do projeto selecionado.\n\n### Como Usar\n1. **Acesso à Página**: Faça login na aplicação. Se a sessão expirar, faça login novamente para continuar.\n2. **Conexão ao Jira**: Certifique-se de ter uma conexão Jira ativa antes de prosseguir. Caso contrário, a página redireciona para o gerenciamento de conexões.\n3. **Configuração de Análise**:\n   - Na barra lateral, selecione o projeto principal de interesse.\n   - Opcionalmente, selecione outros projetos para contextualização.\n4. **Carregar Dados**: Clique no botão \"Processar Análise\" para carregar e processar os dados.\n5. **Gerar Diagnóstico**: Após a carga de dados, selecione um cliente e clique em \"Gerar Diagnóstico com IA\" para criar o diagnóstico estratégico.\n6. **Consulta ao Diagnóstico**: Visualize insights estratégicos nas abas de \"Insights Estratégicos\" e interaja usando a aba de chat.\n7. **Interação via Chat**: Use a caixa de entrada para perguntas adicionais sobre o diagnóstico.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: Como eu faço para configurar a conexão do Jira?**\n*R: Você deve navegar até a página \"Conexões Jira\", onde poderá adicionar ou ativar suas credenciais do Jira. Se nenhuma conexão estiver ativa, a página irá redirecioná-lo automaticamente para configurar uma conexão.*\n\n**P: O que significa 'Projeto Principal' na configuração de análise?**\n*R: O 'Projeto Principal' refere-se ao projeto que você está interessado em analisar. Os dados carregados e o diagnóstico gerado serão baseados nas informações deste projeto.*\n\n**P: Como posso saber se minha sessão expirou?**\n*R: Se a sessão expirar, a aplicação exibirá uma mensagem de aviso indicando que você ficou inativo por uma quantidade aproximada de tempo e sugerirá que faça login novamente.*\n\n**P: O que acontece se o campo 'Cliente' não estiver presente nos dados?**\n*R: A aplicação exibirá uma mensagem de erro indicando que o campo 'Cliente' não foi encontrado. Será necessário ativar este campo nas configurações da sua conta para prosseguir com o diagnóstico.*\n\n**P: Como a IA gera o diagnóstico estratégico?**\n*R: A IA analisa as métricas de desempenho do projeto, como percentual concluído e adesão ao cronograma, e utiliza esses dados para gerar um diagnóstico detalhado, considerando também o perfil do cliente e outros projetos contextuais.*",
        "last_updated": "2025-10-16T11:39:55.030908"
    },
    "9_👤_Minha_Conta": {
        "content": "### Sobre a Página: Minha_Conta\nA página \"Minha Conta\" de uma aplicação Streamlit tem como principal finalidade permitir ao usuário gerenciar suas informações pessoais e preferências dentro da plataforma Gauge Metrics. Nela, os usuários podem atualizar suas informações de perfil, mudar a senha, configurar suas conexões com o Jira e gerenciar preferências relacionadas a campos, inteligência artificial e tokens de API. A interface é dividida em várias abas que facilitam o gerenciamento de diferentes aspectos da conta e garantem uma experiência de usuário intuitiva e personalizada.\n\n### Como Usar\n1. **Acesso Inicial:**  \n   - Certifique-se de estar logado para acessar a página. Caso sua sessão tenha expirado ou você não esteja autenticado, será necessário realizar o login novamente.\n\n2. **Gerenciar Perfil e Senha:**  \n   - Use a aba \"👤 Perfil e Senha\" para visualizar seu usuário e alterar sua senha. Preencha os campos para mudança de senha e, ao concluir, um e-mail de notificação será enviado para confirmar a alteração.\n\n3. **Configurar Conexões Jira:**  \n   - Caso não tenha conexões Jira configuradas, siga as instruções para configurar ou ativar uma conexão no menu correspondente.\n\n4. **Preferências de Campos:**  \n   - Vá para \"Jira: Campos Dinâmicos\" para ativar/desativar campos padrão e personalizados utilizados em análises. Utilize a funcionalidade de pesquisa para encontrar campos específicos e salve suas preferências ao final.\n\n5. **Configurações de IA:**  \n   - Na aba \"Configurações de AI\", selecione o provedor de inteligência artificial preferido e configure as chaves de API conforme necessário, para serviços como Google Gemini ou OpenAI (ChatGPT).\n\n6. **Tokens e Credenciais:**  \n   - Utilize \"🔑 Tokens e Credenciais\" para gerenciar o Token de Acesso Pessoal necessário para integrar ao serviço do Figma. Insira ou remova tokens conforme necessário.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: Como eu faço para alterar minha senha?**  \n*R: Para alterar sua senha, vá à aba \"👤 Perfil e Senha\", preencha os campos \"Senha Atual\", \"Nova Senha\" e \"Confirmar Nova Senha\", e clique em \"Alterar Senha\". Certifique-se de que a nova senha tenha pelo menos 8 caracteres e que coincida com a confirmação.*\n\n**P: O que significa a mensagem 'Nenhuma conexão Jira foi configurada ainda'?**  \n*R: Isso indica que você ainda não configurou conexões com o Jira na sua conta. Você deve seguir o link fornecido para configurar sua primeira conexão a fim de sincronizar dados da sua conta Jira.*\n\n**P: Como posso ativar/desativar campos personalizados para análise?**  \n*R: Vá para a aba \"Jira: Campos Dinâmicos\", e na seção \"✨ Campos Personalizados\", utilize os controles de ativação para selecionar os campos que deseja usar em análises. Não se esqueça de clicar em \"Salvar Preferências de Campos\" para aplicar as mudanças.*\n\n**P: Como eu configuro meu provedor de inteligência artificial?**  \n*R: Na aba \"Configurações de AI\", selecione seu provedor (Google Gemini ou OpenAI) e siga as instruções para inserir ou remover chaves de API. Lembre-se de salvar as configurações após alterações.*\n\n**P: O que eu preciso para usar a integração do Figma?**  \n*R: Para usar a integração do Figma, é necessário inserir um Token de Acesso Pessoal válido. Vá para a aba \"🔑 Tokens e Credenciais\", insira o token no campo dedicado e clique em \"Salvar Token do Figma\".*",
        "last_updated": "2025-10-16T11:43:22.284561"
    },
    "0_🔑_Autenticação": {
        "content": "Com certeza. Aqui está a documentação técnica para a página \"1_🔑_Autenticação\", gerada com base na análise do código-fonte e formatada conforme solicitado.\n\n***\n\n### Sobre a Página: 1_🔑_Autenticação\n\nEsta página serve como o portal de entrada para a aplicação \"Gauge Products Hub\". A sua funcionalidade principal é gerir o acesso dos utilizadores através de um sistema de autenticação robusto. Ela centraliza três operações essenciais: o **Login** de utilizadores existentes, o **Registro** de novas contas e a **Recuperação de Senha** para contas existentes.\n\nQuando um utilizador não está autenticado, a página apresenta uma interface limpa e focada, ocultando a barra de navegação lateral para evitar acessos indevidos. Após um login bem-sucedido, a página realiza uma verificação automática da conexão Jira ativa do utilizador, garantindo que as suas credenciais estão válidas e com as permissões necessárias antes de o redirecionar para as áreas de análise da aplicação. Para utilizadores já autenticados, a página exibe uma mensagem de boas-vindas e oferece a opção de \"Logout\" para encerrar a sessão de forma segura.\n\n### Como Usar\n\nA interação com a página é dividida em três funcionalidades principais, organizadas em abas:\n\n1.  **Para Entrar na sua Conta:**\n    *   Na aba **\"Entrar\"**, preencha os campos \"Email\" e \"Senha\" com as suas credenciais.\n    *   Marque a opção \"Lembrar-me\" se desejar que o seu e-mail seja preenchido automaticamente na sua próxima visita.\n    *   Clique no botão **\"Entrar\"**.\n    *   O sistema irá validar as suas credenciais e, em seguida, a sua conexão ativa com o Jira. Se tudo estiver correto, será redirecionado para o seu Dashboard. Caso contrário, será direcionado para a página de \"Conexões Jira\" para resolver o problema.\n\n2.  **Para Criar uma Nova Conta:**\n    *   Selecione a aba **\"Registrar-se\"**.\n    *   Preencha o seu e-mail corporativo e crie uma senha segura, confirmando-a no campo seguinte.\n    *   Clique no botão **\"Registrar\"**.\n    *   Após o sucesso, receberá uma confirmação na tela e um e-mail de boas-vindas. Poderá então fazer login usando a aba \"Entrar\".\n\n3.  **Para Recuperar a sua Senha:**\n    *   Selecione a aba **\"Recuperar Senha\"**.\n    *   Insira o endereço de e-mail associado à sua conta.\n    *   Clique no botão **\"Enviar E-mail de Recuperação\"**.\n    *   Se o e-mail estiver registrado no sistema, receberá uma mensagem com uma senha temporária e instruções para aceder à sua conta.\n\n4.  **Para Sair (Logout):**\n    *   Se já estiver logado na aplicação, esta página exibirá uma mensagem de boas-vindas e um botão **\"Logout\"**.\n    *   Clique neste botão para encerrar a sua sessão de forma segura, limpando todos os seus dados, exceto o e-mail (caso tenha selecionado \"Lembrar-me\").\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: O que acontece exatamente após eu clicar em \"Entrar\" com as credenciais corretas?**\n*R: Após validar o seu e-mail e senha, o sistema verifica automaticamente a sua \"conexão Jira ativa\". Ele tenta comunicar-se com o Jira usando as credenciais que você salvou. Se a conexão for bem-sucedida e tiver permissão para aceder a projetos, você será redirecionado para a página \"Meu Dashboard\". Se a conexão falhar por qualquer motivo (ex: token expirado) ou se não tiver uma conexão ativa, será levado à página \"Conexões Jira\" para configurar ou corrigir a sua conexão.*\n\n**P: Por que fui redirecionado para a página \"Conexões Jira\" logo após o login?**\n*R: Existem três motivos principais para isso acontecer:\n    1.  Você ainda não configurou ou ativou nenhuma conexão com o Jira no seu perfil.\n    2.  A sua conexão Jira que estava marcada como \"ativa\" falhou na validação. Isso pode ocorrer se o token de acesso expirou, foi revogado, ou o URL do Jira está incorreto.\n    3.  A sua conexão é válida, mas a sua conta no Jira não possui permissão para visualizar ou listar projetos, o que impede a ferramenta de funcionar.*\n\n**P: O que a opção \"Lembrar-me\" faz?**\n*R: Ao marcar a opção \"Lembrar-me\", o seu endereço de e-mail é guardado de forma segura no seu navegador para esta aplicação. Na próxima vez que visitar a página de login, o campo \"Email\" já estará preenchido para si, agilizando o processo de acesso. A sua senha nunca é guardada.*\n\n**P: Criei a minha conta. Qual é o próximo passo para usar a ferramenta?**\n*R: Após criar a sua conta, o próximo passo é fazer login. Ao aceder pela primeira vez, como ainda não terá uma conexão com o Jira configurada, o sistema irá automaticamente redirecioná-lo para a página \"Conexões Jira\". Nessa página, você deverá adicionar e validar as credenciais do seu Jira para que a aplicação possa começar a recolher e analisar os seus dados.*",
        "last_updated": "2025-11-13T15:51:59.515796"
    },
    "1_🌍_Dashboard_Global": {
        "content": "Claro, aqui está a documentação técnica para a página \"Dashboard_Global\", elaborada no papel de um Redator Técnico e seguindo a estrutura solicitada.\n\n---\n\n### Sobre a Página: Dashboard_Global\n\nO **Dashboard Global** oferece uma visão macro da produtividade e do fluxo de trabalho em múltiplos projetos do Jira. A sua principal função é comparar a quantidade de itens (tarefas, bugs, etc.) criados versus a quantidade de itens encerrados num determinado período de tempo. A página agrega dados de todos os projetos selecionados e apresenta métricas chave (KPIs) para identificar rapidamente se o volume de trabalho está a aumentar ou a diminuir. Além dos KPIs, fornece gráficos detalhados sobre os tipos de itens e os projetos com maior atividade, e inclui uma funcionalidade de análise por Inteligência Artificial para uma interpretação qualitativa dos dados.\n\n### Como Usar\n\nPara utilizar o Dashboard Global de forma eficaz, siga estes passos:\n\n1.  **Aceda à Barra Lateral (Sidebar):** Todas as opções de filtragem estão localizadas na barra lateral à esquerda.\n2.  **Selecione o Período de Análise:** No menu suspenso \"Selecione o Período de Análise\", escolha o intervalo de tempo que deseja analisar (ex: \"Últimos 7 dias\", \"Último mês\"). Por defeito, a página carrega os dados dos últimos 7 dias.\n3.  **Escolha os Projetos:** Na caixa de seleção \"Selecione os Projetos\", pode escolher um ou mais projetos para incluir na análise. Por defeito, todos os projetos disponíveis são selecionados. Se desmarcar todos, a página irá solicitar que selecione pelo menos um.\n4.  **Analise as Métricas Principais (KPIs):** No topo da página, quatro métricas principais são exibidas:\n    *   **Itens Criados:** O número total de itens abertos no período.\n    *   **Itens Encerrados:** O número total de itens concluídos no período.\n    *   **Balanço (Absoluto):** A diferença simples entre itens criados e encerrados. Um número positivo indica que mais itens foram criados do que encerrados.\n    *   **Balanço Percentual:** Indica o crescimento (ou redução) do backlog em relação ao total de itens criados. A pequena seta (`delta`) compara este valor com o do período anterior equivalente.\n5.  **Explore os Gráficos Detalhados:** Utilize as abas (tabs) para ver mais detalhes:\n    *   **📊 Itens Criados:** Mostra gráficos de barras com a contagem de itens criados por tipo (`Issue Type`) e por projeto (`Project`).\n    *   **🏁 Itens Encerrados:** Apresenta os mesmos gráficos, mas para os itens que foram concluídos no período.\n6.  **Utilize a Análise por IA (Opcional):**\n    *   Aceda à aba \"🤖 Análise IA\".\n    *   Clique no botão \"**Gerar Análise de Segregação**\". A IA irá analisar uma amostra dos itens criados e encerrados e fornecer um resumo qualitativo sobre os tipos de trabalho predominantes.\n7.  **Consulte os Dados Brutos:** Se precisar de ver a tabela completa com todos os dados extraídos, expanda a secção \"**Ver dados brutos**\" no final da página.\n\n### Perguntas Frequentes (FAQ) da Página\n\n**P: O que significa o \"Balanço Percentual\" e por que o indicador de variação (delta) fica vermelho quando o número é positivo?**\n*R: O \"Balanço Percentual\" é calculado como `(Criados - Encerrados) / Criados`. Ele mede o quanto o seu backlog cresceu em proporção ao trabalho que entrou. Um valor positivo significa que mais itens foram criados do que encerrados, resultando num aumento do trabalho pendente. O delta usa uma cor invertida (`inverse`): ele fica **vermelho** para um aumento (um resultado negativo para a produtividade) e **verde** para uma diminuição (um resultado positivo), tornando a interpretação do estado do fluxo de trabalho mais intuitiva.*\n\n**P: Como a \"Data de Conclusão\" de um item é determinada no dashboard?**\n*R: A \"Data de Conclusão\" é determinada pela seguinte lógica: o sistema primeiro procura pelo campo `resolutiondate` do Jira. Se este campo existir para um item, essa é a data utilizada. Caso contrário, se o item estiver num status considerado \"Concluído\" (como 'Done', 'Encerrado', etc.), mas não tiver uma `resolutiondate`, o sistema utiliza a data da última atualização (`updated`) como uma aproximação da data de conclusão.*\n\n**P: Os dados apresentados são atualizados em tempo real? Se eu fechar uma tarefa no Jira, ela aparece imediatamente aqui?**\n*R: Não. Para otimizar o desempenho e reduzir o número de chamadas ao Jira, os dados são guardados em cache por **1 hora (3600 segundos)**. Isto significa que, após carregar os dados pela primeira vez, as informações só serão atualizadas do Jira se o cache expirar ou se um botão de recarregamento for pressionado após um erro. Quaisquer alterações feitas no Jira só serão refletidas no dashboard após esse período.*\n\n**P: A \"Análise IA\" processa a descrição de todos os itens listados no período?**\n*R: Não. Para garantir uma resposta rápida e gerir custos, a funcionalidade de IA analisa uma **amostra de até 30 itens criados e 30 itens encerrados** do período selecionado. Ela foca-se nos itens mais recentes para fornecer um resumo qualitativo relevante, mas não analisa o conjunto de dados completo.*",
        "last_updated": "2025-11-13T15:54:56.761396"
    }
}